[
	{
		"id": "help-me-delivery",
		"name": "Help Me Delivery",
		"desc": "Giving vulnerable populations an easy platform to identify local shops, build shareable shopping lists that they can easily share with friends, family or trusted connections on social media.",
		"creators": "Pascal Schlatter",
		"url": "https://helpmedelivery.com/",
		"video": "https://www.youtube.com/watch?v=riRi5iUqe6U",
		"image": "https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_thumbnail_photos/000/999/580/datas/medium.PNG",
		"devpost": "https://devpost.com/software/help-me-delivery",
		"description": "Giving vulnerable populations an easy platform to identify local shops, build shareable shopping lists that they can easily share with friends, family or trusted connections on social media.",
		"content": "\n  <h2>Inspiration</h2>\n\n<p>During the current Global Crisis there is a significant percentage of the population that are considered to be vulnerable and unable to go out to complete essential shopping. This includes the elderly, currently sick or those with preexisting conditions that have been asked to completely isolate. The knowledge that there is a large percentage of people who are in this position has been widely publicized but many are left wondering how they can help or even how they can ask for help during this challenging time. Help Me Delivery tries to answer those questions through an easy to use website that allows for store selection, shopping list creation and easy sharing between trusted individuals. My hope is that anyone who needs help can turn to Help Me Delivery to create a shopping list of essentials that they then share on social media asking for assistance. Or, if you are someone who wants to help that they can share the link to the site on forums or social media saying that they are happy to make deliveries to anyone who needs it.</p>\n\n<h2>What it does</h2>\n\n<p>Help Me Delivery is a website that people can turn to when they need to ask someone for help to complete their shopping. When visiting the site it presents you with local grocery stores that are currently listed as open. A user can then select a shop and develop a shopping list using a simple pop-up dialog. When finished this information is then compiled and formatted into a shopping list and a unique link is generated that they can share with a trusted friend and/or relative to invite them to help. When visiting this unique link the shopping list and address of the shop are presented along with a friendly message of how to help out.</p>\n\n<h2>How I built it</h2>\n\n<p>The HelpMeDelivery.com website is built using React and Node.js with the visual components coming from <a href=\"https://material-ui.com/\" rel=\"nofollow\">Material-UI</a>. The React solution is deployed on an Amazon EC2 Linux server and is being server using Nginx. This frontend interacts with two Python backend APIs, the first of which is an endpoint which takes your location data and returns all the relevant and nearby shops that are currently listed as open. This information is extracted from the <a href=\"https://developer.foursquare.com/places\" rel=\"nofollow\">Foursquare Places API</a> and then formatted in such a way that only the relevant information is returned to the site. The second API is a wrapper for a MongoDB which is used to store newly created shopping lists, assign them an ID and then to return them when the generated link is accessed. These Python APIs are deployed on AWS Lambda serverless functions.</p>\n\n<h2>Challenges I ran into</h2>\n\n<p>A core challenge that I wanted to tackle throughout the development of Help Me Delivery was making the process as easy as possible while also protecting the person requesting the shopping trip. This lead to making important and challenging design decisions about how shopping lists could be shared and what data we would request and share on the shopping list URL. It also lead to the development of the unique URL system to ensure the shopping list can only be viewed by receiving the URL from the creator of the list. </p>\n\n<p>My experience in the past mainly revolved around creating functional backend applications but this mission required me to expand my knowledge further and take on a new technology and programming language. A result of taking on a new technology like this was the inexperience of deploying such an application into production. The Hackathon had a strict deadline of 4 days of development time which required a strict scope of what the application functionality would be and what it would look like at the end of this time. The strict time management together with the unfamiliarity of how to deploy a production React web application proved to be a challenge when development was completed.</p>\n\n<h2>Accomplishments that I&apos;m proud of</h2>\n\n<p>I am proud that the final product turned out to be as polished as I had hoped and that the functionality is how I had envisioned and planned for. I am satisfied with the level of functionality achieved given the time we had to develop and deploy the application. </p>\n\n<p>I am however mostly proud of the fact that this application is now available free of charge to anyone who is currently struggling to get their shopping done. I hope that Help Me Delivery has the impact of being a tool that anyone can use with ease and makes people&apos;s lives a little bit easier during this tough time. </p>\n\n<h2>What I learned</h2>\n\n<p>I previously have not had much experience writing in React and Node.js outside of some mobile app development. So one of the big learning curves for me was designing and building and deploying an interactive and easy to use website. I spent a lot of time testing components to see if they were as easy to use as I had hoped and constantly tweaking flows to try and make the process as quick and simple as possible for anyone to use. </p>\n\n<p>The process of developing a full stack application in a small time frame was also something that I previously had not had much experience in and was steep learning curve for me when selecting technologies to interact with each other and developing interactions between different components of the solution.</p>\n\n<h2>What&apos;s next for Help Me Delivery</h2>\n\n<p>The core idea of Help Me Delivery is to make the process of creating and requesting shopping from a friend as quick and easy as possible. I think that there will always be elements that can be improved, revised and newly introduced to try and build towards that idea more and more. For me I think that <strong>integration into Social Media</strong> will play a major role in this. The aspect of sharing is something that is important to the project and would be something great that could be built upon through the use of Facebook Messenger integration or even Twilio for the mobile communication of shared shopping lists. As it stands now the sharing of the link needs to be done manually, but I think adding some automated messaging options will make the process even easier</p>\n\n<p>Full mobile support is also a key area of expansion and I think that the development choice of using React allows for easy entrance into cross platform mobile applications through React-Native. This would then also allow for a new way of sharing and accepting shopping lists with trusted friends through device to device communication. There are further points of development available that could be aided through mobile integration such as the inclusion of more of the shopping process such as order acceptance, reporting of unavailable products and delivery estimation times. </p>\n\n"
	},
	{
		"id": "webfounation",
		"name": "WeeGlobe",
		"desc": "WeeGlobe as it stands is a proof of concept that we hope illustrates a glaring deficiency with online education that has come to light with so many households in mandated or voluntary quarantine.",
		"creators": "Irene Ihnatenko, John Ferrel",
		"url": "https://www.weeglobe.com/",
		"video": "https://www.youtube.com/watch?v=ZKaG3cnM0v0",
		"image": "https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/001/000/633/datas/medium.png",
		"devpost": "https://devpost.com/software/webfounation",
		"description": "WeeGlobe as it stands is a proof of concept that we hope illustrates a glaring deficiency with online education that has come to light with so many households in mandated or voluntary quarantine.",
		"content": "\n  <p>Hi! We&#x2019;re the WeeGlobe team, and we&#x2019;d like to introduce you to our idea.</p>\n\n<p>Web application Weeglobe is a great way for kids to learn about Covid-19, read stories, watch videos, learn new skills, and connect to their teacher and classmates using online classrooms.</p>\n\n<p>Youtube is the place where kids spend most of their time. Our goal is a safe web application where kids could learn and have fun. </p>\n\n<p>Many school districts use multiple tools for remote learning. Leading to a fragmented and sometimes confusing experience for students, parents, and teachers. Learning, video chat, assignments are split across multiple services highlighting the need for a single service.</p>\n\n<p>The goal is to help kids not only learn about Covid-19, but to allow them to communicate with classmates, friends, and teachers online. A teacher can add learning materials, give assignments, and grant rewards for completed work.</p>\n\n<p>WeeGlobe, as it stands, is a proof of concept that we hope illustrates a glaring deficiency with online education that has come to light with so many households in mandated or voluntary quarantine. We&#x2019;ve experienced first hand the stress and anxiety of these unprecedented times. Our aspiration is the value and purpose of this idea shine through. </p>\n\n<h2>How I built it</h2>\n\n<p>We built it over the last two days, using Express.js, Node.js, Javascript, HTML, and CSS</p>\n\n<h2>Challenges I ran into</h2>\n\n<p>Ambition and time</p>\n\n<h2>Accomplishments that I&apos;m proud of</h2>\n\n<p>We worked on WeeGlobe for ~30 hours. We&apos;re proud of what we got done in that timeframe</p>\n\n<h2>What I learned</h2>\n\n<p>To start earlier and how much we love programming!</p>\n\n<h2>What&apos;s next for WeeGlobe</h2>\n\n<p>We&apos;re looking to flesh it out and add missing features, such as classroom connect and original content.</p>\n\n<p>Thank you for your time and consideration! </p>\n\n"
	},
	{
		"id": "help-supply",
		"name": "Help Supply",
		"desc": "Help Supply is the simplest way for our highly stressed healthcare workers to name all their needs, from groceries to pet care to mental health, and connect to the people who can help them.",
		"creators": "David Zangwill, Johnson Fung, Caleb Yarian, Eric Alper",
		"url": "https://github.com/helpsupply/helpsupply",
		"video": "https://www.youtube.com/watch?v=G7Ito34Hn5s",
		"image": "https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_thumbnail_photos/001/003/773/datas/medium.png",
		"devpost": "https://devpost.com/software/help-supply",
		"description": "Help Supply is the simplest way for our highly stressed healthcare workers to name all their needs, from groceries to pet care to mental health, and connect to the people who can help them.",
		"content": "\n  <h2>Inspiration</h2>\n\n<p>Recognizing the coming dramatic strain on the healthcare system, we decided to transform our COVID-19 anxiety into a solution. We wanted to leverage our experience from Dropbox, Adobe, Work &amp; Co, and Sid Lee to build a service that supports the quality of life and wellbeing of our heroes at the frontline, healthcare professionals (HCPs). </p>\n\n<h2>Testing our theory</h2>\n\n<p>We hypothesized that many community-based organizations would emerge to serve the various HCP needs, ranging from PPE to groceries. Conversations with HCPs validated that their highest need was PPE equipment, yet conversations with hospital administrators, folks on the PPE supply side, and other teams working to solve the PPE shortage made clear that those shortages will likely be filled. </p>\n\n<p>Moreover, we learned the ongoing &quot;life needs&quot; HCPs have caused by their fight against the coronavirus won&#x2019;t be solved quickly. These needs include grocery shopping, meal preparation, prescription pickup and delivery; mental health care and emotional support; child, elder, pet, and other dependent care; safe transit and temporary housing, etc. </p>\n\n<h2>What it does</h2>\n\n<p>We realized these life needs could be well served through a platform that enables HCPs to signal their needs in real time, and delivers that data to service providers who can fulfill those needs quickly. Our product vision became an effective and empathic virtual assistant that can reliably fulfill HCP needs without adding the stress of having to find out where to go to get needs met, if the suppliers are trustworthy, etc. </p>\n\n<h2>How we built it</h2>\n\n<p>To minimize the time we spent administering infrastructure, while maximizing our ability to iterate on our data model and scale our infrastructure (should we be so lucky) we chose Firebase as our application platform. This additionally allows us to use Javascript everywhere &#x2014; simplifying the set of skills required from volunteers and those contributing to the code. </p>\n\n<h2>Challenges we ran into</h2>\n\n<p>One challenge we face is how to ensure services are delivered with a measured amount of safety. Services like childcare require face to face interaction where social distancing is impossible. We are mitigating this by starting with services such as groceries and emotional support, that can be done with minimal or no face to face contact. </p>\n\n<p>Additionally we are partnering with suppliers to ensure safety. For example, in NYC we&#x2019;re helping activate Y1 and Y2 med students who are trained on how to take precautions, yet not trained enough to help on the frontlines, leaving them to be good candidates for services such as child and pet care.</p>\n\n<h2>Accomplishments that I&apos;m proud of</h2>\n\n<p>We spoke to 10 HCPs on the ground, and 8/10 validated that they are working longer hours and are having a significantly hard time getting their day to day needs met. The only ones that did not validate this, were in areas where COVID has not (yet) become active. </p>\n\n<p>Also we have an experienced, capable, and fun team; I&apos;m proud we&apos;re all collaborating on something we all so strongly believe will be helpful.</p>\n\n<h2>What&apos;s next for Help Supply</h2>\n\n<p>Our strong team is actively building our V1 web app and planning to have a release this week. We are also building a chat interface to enable even easier onboarding, verification, and request submission. Additionally we&apos;re talking to partner organizations on the supply side to ensure request fulfilment. Our hope is to find the right resources and partnerships to effectively roll Help Supply out in US, then translate into other languages for more countries and support the wellbeing of HCPs around the world.</p>\n\n"
	},
	{
		"id": "covexit",
		"name": "Covexit",
		"desc": "An online marketplace exclusively for local stores with door-to-door delivery to customers",
		"creators": "Ines Filipp, Kevin Ivan, Bálint Csizmadia, Mia-Malaika Lange, Adesanmi Akolade dotun, Fabian Katz, Volker Jetter, Marco Schmid, Philipp Veller, Ed Rivas, Nicolai Huss, Thomas  Betz-Mors, Moritz Giebel, Shreyansh Jain",
		"url": "https://covexit.webflow.io/",
		"video": "https://www.youtube.com/watch?v=dNVbk9M_jv8",
		"image": "https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_thumbnail_photos/001/002/877/datas/medium.jpg",
		"devpost": "https://devpost.com/software/covexit",
		"description": "An online marketplace exclusively for local stores with door-to-door delivery to customers",
		"content": "\n  <h2>What Inspired us?</h2>\n\n<p>The corona virus puts an extreme burden on small and local businesses in particular. Many shops have to close. No sales are generated. Businesses go bankrupt. As a result, many employees will lose their job.\nWhilst many products could be sold online a lot of the owners don&apos;t know how to do that or can&apos;t afford the fees of existing marketplaces (e.g. Amazon). At the same time people are stuck at home and are looking for exactly those products online.\nOur absolute priority is to help these businesses and all the people involved with them and to ensure their very existence. For this purpose, we have been working day and night and have come to the following solution, which solves these problems:</p>\n\n<hr>\n\n<h2>Our Solution:</h2>\n\n<p>An online marketplace exclusively for local stores with door-to-door delivery to customers.</p>\n\n<hr>\n\n<h2>So what is the impact of Covexit?</h2>\n\n<p>Corona increases the awareness of shop owners that they have to go online in order to exist in the short and long run. The crisis thus represents a wake-up call. On the other hand, the Corona crisis also increases the awareness that local businesses need support. Covexit&apos;s solution concept can be implemented regionally, nationally and internationally, so people all over the world benefit from the solution. In total, thousands or millions of businesses can be saved from insolvency and millions of jobs can be secured.\nIn addition, it is a sustainable concept that is also applicable after the Corona crisis and helps businesses to adapt to the current developments in our society.</p>\n\n<hr>\n\n<h2>Our Solution Approach:</h2>\n\n<p><strong>1) Features:</strong><br>\na) Define the participating types of stores (e.g. clothing, &#x2026;)<br>\nb) For every type of store: define product categories<br>\nc) Geofilter (e.g. perimeter &lt; 20 mi)<br>\nd) Search feature for particular stores and products<br>\ne) Discover feature for local stores using interactive map<br>\nf) Pay and order features  </p>\n\n<hr>\n\n<p><strong>2) Bringing companies to the platform</strong><br>\na) Develop guidelines on which companies can access the platform<br>\nb) Communication strategy (e.g. via business associations such as BdS or industry associations such as FdF)<br>\nc) Simple guidelines so that owners can upload their products to the platform independently  </p>\n\n<hr>\n\n<p><strong>3) Bringing users to the platform</strong><br>\na) Communication strategy  </p>\n\n<hr>\n\n<p><strong>4) Distribution strategy</strong><br>\na) Who delivers?  </p>\n\n<ul>\n<li>Collaboration with other Hackathon projects dealing with the delivery challenge --&gt; Suppliers can choose one of the two options:<br>\n\n<ul>\n<li>self-shipment of the supplier (bicycle (cargo bike), company car) if possible or<br></li>\n<li>with support of the platform operator (similar to Amazon)<br>\n--&gt; support of the platform operator: cooperation with local taxi companies, students and part-time workers can register as temporary drivers.<br></li>\n</ul></li>\n<li>Exploration of existing and new delivery routes (DHL, taxi, bicycle couriers, etc.)<br>\nb) Delivery regulations (requirements for retailers and suppliers, especially virus safety)<br>\nc) Which products may be delivered?<br></li>\n</ul>\n\n<hr>\n\n<h2>Who should use Covexit?</h2>\n\n<p>Covexit is mainly aimed at small businesses that do not yet have their own online shop and that are currently not generating any sales. In addition, Covexit also offers companies that already have an online shop a great added value so that all local shops can benefit from the Covexit offer.<br>\nOn the other hand, customers who want to support local shops or customers who simply want to explore shops in their area are particularly attracted by the offer. Covexit is therefore the perfect solution for every consumer who wants to help small shops to secure their existence. </p>\n\n<hr>\n\n<h2>Why should companies use Covexit:</h2>\n\n<p>Covexit offers companies a very simple way to offer their products online. Thus they generate sales again and consequently survive the corona crisis. This also saves many employees from losing their jobs.\nIn addition, the companies benefit from the platform&apos;s wide reach, so that they can acquire new customers in addition to their regular customers.\nEven after the Corona crisis, Covexit still offers companies great added value, as online shopping becomes increasingly important. Especially younger people are shopping less and less in local stores. Covexit thus helps them to secure their long-term existence.</p>\n\n<hr>\n\n<h2>Why should customers use Covexit:</h2>\n\n<p>The Corona crisis in particular has increased the awareness of many consumers that local shops need their support and thus also the willingness to buy local products. Covexit offers them the perfect opportunity to do this. In addition, customers can easily explore the treasures of their city. Covexit is fully focused on functionality. Through its clear layout and logical structure, it is made as easy as possible for the customer to support and get to know shops in their vicinity.\nThanks to the direct product search, consumers can quickly find the products of their choice and thus purchase them easily through the platform.</p>\n\n<hr>\n\n<h2>Scalability</h2>\n\n<p>There are over 340,000 retailers in Germany. In Karlsruhe alone, for example:</p>\n\n<ul>\n<li>537 clothing stores</li>\n<li>274 Furniture and furnishing stores</li>\n<li>70 bookshops</li>\n<li>232 Jewellers</li>\n</ul>\n\n<p>All these small businesses are affected by the crisis and fear for their existence. Millions of jobs in Germany alone depend on it... and worldwide there are many more.</p>\n\n<p>But even after the Corona crisis it will be essential for the many companies to offer their products online, as the current generation predominantly shops online and at some point in time it will not be able to fall back on the older generation. Most of the retailers now have their own homepage but only a few are able to make significant sales through it. Currently only about 30% of all small and medium sized German companies own an online shop and more than half of all German companies do not sell online at all. In other countries these figures are even more significant. It is crucial to close this gap so that our beloved shops next door can survive in the future.</p>\n\n<hr>\n\n<h2>How have we built our solution?</h2>\n\n<ol>\n<li>Finding solutions together: How can we support small local businesses in the current situation?<br></li>\n<li>Pitch of the proposed solutions<br></li>\n<li>Agreement on a solution: Covexit<br></li>\n<li>Definition of the solution approach (see above: solution approach)<br></li>\n<li>Creation of an overview of all problems sorted according to the different stages of the solution path. Subsequently subdividing these problems into further subproblems<br></li>\n<li>Finding solutions for individual subproblems<br></li>\n<li>Derivation and definition of our MVP (see below)<br></li>\n<li>Search for appropriate designers as well as front-end and back-end developers to implement the MVP<br></li>\n<li>Division into teams (business concept, frontend, backend, designer, coordination team, marketing)<br></li>\n<li>Task structuring, backlog, prioritization and assignment in Trello<br></li>\n<li>Regular team grooming and reprioritisation of the backlog<br></li>\n<li>Definition of our name<br></li>\n<li>Design of our logo<br></li>\n<li>Elaboration design<br>\n&gt; Corporate design<br>\n&gt; Design assets -&gt; technical development<br>\n&gt; Design system for the prototype<br>\n&gt; Prototype construction<br></li>\n<li>Setting up the technical platform<br>\n&gt; Backend structure and technology definition<br>\n&gt; Front-end structure and technology definition<br>\n&gt; technical connection<br>\n&gt; Prototyping for login<br></li>\n<li>Definition of our USP, the added value from the customer&apos;s point of view, shop view (both without and with already existing online shop). Definition of our added value compared to competing solutions as well as Amazon, Google Maps<br></li>\n<li>Refinement of the prototype with retailers<br></li>\n<li>Fine-tuning of key business issues regarding the roll-out, the delivery process, the verification process and the business model<br></li>\n<li>Conception of the marketing strategy to get companies on the platform (reaching critical mass)<br></li>\n<li>Conception of the marketing strategy to get customers on the platform<br></li>\n<li>Opening of social media channels<br></li>\n<li>Creation of our own website</li>\n<li>Video production and upload on YouTube<br></li>\n<li>Creation of the DevPost project<br></li>\n</ol>\n\n<hr>\n\n<h2>Our MVP (Minimum Viable Product):</h2>\n\n<p><strong>Customer view (mobile view of the web application):</strong><br>\n&#x2022; Strolling function: Interactive map showing the user shops in his or her vicinity<br>\n&#x2022; Google Maps integration (overview of locations of participating stores and filter function by store type)<br>\n&#x2022; Geofilter: Via location services; users are only shown shops in their vicinity<br>\n&#x2022; Company page with image, name, logo, overview of product categories<br>\n&#x2022; Product page with picture, name, information, shopping cart<br>\n&#x2022; Shopping cart function<br>\n&#x2022; Order overview page<br>\n&#x2022; Payment with PayPal<br>\n&#x2022; Registration  </p>\n\n<p><strong>Company view (Web App):</strong><br>\n&#x2022; Simple Registration<br>\n&#x2022; Easy way to upload products (name, picture, description, price, quantity, category)<br>\n&#x2022; Overview of sales (period, order total, units)<br>\n&#x2022; Overview of orders (pending, shipped, return request)  </p>\n\n<hr>\n\n<h2>Our current status:</h2>\n\n<p>&#x2022; Business Concept for MVP completely defined<br>\n&#x2022; Walkthrough prototype for the mobile version was created<br>\n&#x2022; Frontend of the MVP almost finished<br>\n&#x2022; Backend structures still need to be adapted<br>\n&#x2022; First contact with retailers has been made and interested parties have been identified<br>\n&#x2022; Social media channels opened<br>\n&#x2022; First marketing concept in place<br>\n&#x2022; Branding concept has been established<br>\n&#x2022; Plan for the rollout ready  </p>\n\n<hr>\n\n<h2>What&apos;s next:</h2>\n\n<p>&#x2022; Completion of the front-end<br>\n&#x2022; Adaptation of the back-end (decide on E-Commerce Backend Framework to integrate)<br>\n&#x2022; Completion of the Web-App<br>\n&#x2022; Refinement of the marketing strategy<br>\n&#x2022; Clarification of legal issues and the legal form<br>\n&#x2022; Create guidelines for dealers<br>\n&#x2022; Bring dealers to the platform<br>\n&#x2022; Once critical mass is reached, bring customers to the platform<br>\n&#x2022; Test phase according to our rollout concept<br>\n&#x2022; Then rollout to other cities  </p>\n\n<hr>\n\n<h2>Challenges we have faced:</h2>\n\n<p>&#x2022; Time, time and again time!<br>\n&#x2022; Putting a team together correctly according to competencies<br>\n&#x2022; Organization of a large team<br>\n&#x2022; Finding solutions without a great budget<br>\n&#x2022; Integration of payments --&gt;legal issues  </p>\n\n<hr>\n\n<h2>What we have learned:</h2>\n\n<p>&#x2022; The importance of good organization<br>\n&#x2022; Important to structure problems well and to break them down into subproblems<br>\n&#x2022; Only together as a team such a project can be realized<br>\n&#x2022; Motivation is key!  </p>\n\n<hr>\n\n<h2>Things we are proud of:</h2>\n\n<p>&#x2022; Our idea, our concept, our team and everything we have achieved in the last few days<br>\n&#x2022; The great feedback from retailers and all the supporters. This alone is motivation enough to give 110% for the next days, weeks and months!</p>\n\n<hr>\n\n<h2>At this point a huge thank you to our wonderful team that worked day and night to realize a solution to help the small local businesses!</h2>\n\n"
	},
	{
		"id": "predict-covid",
		"name": "Predict COVID",
		"desc": "Predict the 2020 COVID-19 pandemic outbreak by comparing countries with a live-updating, interactive data visualization.",
		"creators": "Lachlan Campbell, Zach Latta",
		"url": "https://predictcovid.com",
		"video": "",
		"image": "https://rwjs-discourse.nyc3.cdn.digitaloceanspaces.com/optimized/1X/cc6b2e1a0a8a2f93345a476144fbfc898d1646cb_2_1380x806.jpeg",
		"devpost": ""
	},
	{
		"id": "tutorbook",
		"name": "Tutorbook",
		"desc": "Virtual student support (through online peer-to-peer tutoring) for schools closed due to COVID-19.",
		"creators": "Nicholas Chiang, Budianto IP, Kartik Choudhary, Eric Feltgen, Viki Pro",
		"url": "https://tutorbook.app/",
		"video": "https://www.youtube.com/watch?v=futh125ovR8",
		"image": "https://challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_thumbnail_photos/001/002/580/datas/medium.png",
		"devpost": "https://devpost.com/software/tutorbook",
		"description": "Virtual student support (through online peer-to-peer tutoring) for schools closed due to COVID-19.",
		"content": "\n  <h2>Inspiration</h2>\n\n<p>My school (Gunn High School) used to use paper to manage their peer tutoring program. It was absolutely ridiculous! If you wanted a tutor, you used to have to physically walk across campus to the &quot;Academic Center&quot;, fill out a paper application form, and then wait while the peer tutoring coordinator took that form, filed it into a huge binder of similar forms, and flipped through the &quot;Tutor Binder&quot; to find a tutor that fit within your criteria (i.e. a tutor who can tutor the subjects you want when you&apos;re available).</p>\n\n<h2>What it does</h2>\n\n<p>For an even briefer overview of our project, head over to <a href=\"https://tutorbook.app/signup/\" rel=\"nofollow\">this form</a>. Or, continue reading for a slightly more in-depth description...</p>\n\n<p>Now, Gunn (and all the other schools in PAUSD) use Tutorbook to manage it&apos;s peer tutoring program:</p>\n\n<ul>\n<li>Peer tutors signup, create their profiles, respond to lesson requests, and track their service hours (usually the required-for-graduation service hours) <strong>all</strong> on Tutorbook. </li>\n<li>Students can then search, message, and book those tutors--from anywhere, at anytime.</li>\n<li>Supervisors (the people who used to flip through those binders) manage profiles, match students with tutors (if needed; most of the matching can be done by the students themselves), send lesson reminders, and approve/reject service hour requests.</li>\n</ul>\n\n<p><strong>Note that</strong> each school gets it&apos;s own &quot;web app&quot; at a different <code>.tutorbook.app</code> subdomain (much like Slack workspaces) and you&apos;re only able to login to that school&apos;s web app (to view it&apos;s tutors and such) if you have the school&apos;s email address (e.g. to get into <a href=\"https://gunn.tutorbook.app/app/\" rel=\"nofollow\">Gunn&apos;s web app</a> you must login with an <code>@pausd.us</code> or <code>@pausd.org</code> email address).</p>\n\n<p>Since COVID-19 closed Gunn, we&apos;ve expanded the functionality of Tutorbook to enable peer tutors to log service hours from online (via any platform that their students and staff prefer) tutoring appointments:</p>\n\n<ol>\n<li>Students log into Tutorbook&#x2019;s web app like they normally would and clock-in to their peer tutoring sessions. When the clock-in, they&#x2019;re given a prompt to upload proof of their tutoring session. Such proof could include:\na. Screenshots of their chat history on Discord, Slack, WhatsApp, or any other messaging platform.\nb. Recordings of their online tutoring sessions on Zoom, Skype, Google Hangouts, Whereby, or any other video conferencing app.\nc. PDFs of what they worked on (e.g. a math problem set).</li>\n<li>Or, students can log service hours <strong>after</strong> the lesson finished (without having to clock-in and clock-out) by uploading proof of their lesson (like above) and specifying how many service hours they&apos;re requesting.</li>\n</ol>\n\n<h2>How I built it</h2>\n\n<p>For very in-depth technical insights as to how Tutorbook works, check our <a href=\"https://tutorbook.app/docs/\" rel=\"nofollow\">documentation</a> (automatically generated with <a href=\"https://jsdoc.app\" rel=\"nofollow\">JSDocs 3</a>) or <a href=\"https://github.com/tutorbookapp/tutorbook\" rel=\"nofollow\">source available code</a>. Or, continue reading for a brief, high-level overview...</p>\n\n<p>Tutorbook was built using <a href=\"https://firebase.google.com\" rel=\"nofollow\">Firebase</a> (for our back-end), HTML, SCSS, and Vanilla JavaScript (no front-end framework to be seen here haha). While I probably should have used <a href=\"https://vuejs.org/\" rel=\"nofollow\">Vue</a> or <a href=\"https://reactjs.org\" rel=\"nofollow\">React</a>, I had originally created my own <a href=\"https://tutorbook.app/docs/module-@tutorbook_render.html\" rel=\"nofollow\">rendering solution</a> and migrating the entire codebase over to a framework was <strong>not</strong> in the scope of this hackathon.</p>\n\n<p>For this hackathon, I teamed up and worked on polishing out some scalability issues (e.g. <a href=\"https://github.com/tutorbookapp/tutorbook/issues/254\" rel=\"nofollow\">automatically creating school subdomains w/ AWS R53, CloudFront, and S3</a>, <a href=\"https://github.com/tutorbookapp/tutorbook/issues/259\" rel=\"nofollow\">adding an onboarding flow</a>, etc).</p>\n\n<h2>What I learned</h2>\n\n<p>I personally learned a lot about AWS (as it relates to wildcard (e.g. <code>*.tutorbook.app</code>) DNS records), scalability issues with Firebase, and how best to triage work with GitHub <a href=\"https://github.com/tutorbookapp/tutorbook/issues\" rel=\"nofollow\">Issues</a>, <a href=\"https://github.com/orgs/tutorbookapp/projects/1?fullscreen=true\" rel=\"nofollow\">Projects</a>, and <a href=\"https://github.com/tutorbookapp/tutorbook/milestones/\" rel=\"nofollow\">Milestones</a>.</p>\n\n<h2>What&apos;s next for Tutorbook</h2>\n\n<p>We&apos;re going to build a feature that enables schools to create landing pages for their virtual student support services (e.g. a page with a description of the school and a list of their peer tutors). Schools will then be able to send all of their students a link to this page (e.g. <code>gunn.tutorbook.app</code> for Gunn High School&apos;s landing page) where they (the students) will be able to see all of their school&apos;s virtual support services (e.g. through links on the page description) and peer tutors in a single place.</p>\n\n"
	}
]
